{
    "1": {
        "1": {
        "Ciências": "Compara características de materiais do cotidiano (cor, brilho, odor, sabor, textura, transparência, temperatura e forma); \nidentifica atitudes de preservação ambiental e descarte correto; \nlocaliza e nomeia partes do corpo (órgãos dos sentidos, cabeça, pescoço, tronco, membros) e explica funções; \nreconhece hábitos saudáveis, autocuidado e respeito às diferenças; \nidentifica objetos/tecnologias que ampliam sentidos; identifica escalas de tempo (dia, semana, mês, ano); \ncaracteriza céu e astros visíveis; \nreconhece o Sol como fonte natural de luz e calor.",
        "Geografia": "Localiza pessoas/objetos nos espaços de vivência usando referenciais (dentro/fora, ao lado, frente/trás, perto/longe, cima/baixo, antes/depois, entre, junto/separado); \nreconhece e elabora símbolos de objetos do espaço vivido; \ndescreve a paisagem e a ação humana nas transformações; \nassocia vestuário/hábitos à variação de temperatura/umidade; \nidentifica grupos sociais (família, escola, comunidade) e atividades; reconhece diversidade humana e situações de preconceito.",
        "História": "Narra a própria identidade e história de vida; \ndescreve cotidiano de crianças hoje (família, escola, comunidade); \nnarra manifestações culturais dos grupos de convívio; \ncompara modos de viver de crianças em diferentes tempos e espaços a partir de fontes; narra regras, direitos e responsabilidades na família, escola e comunidade.",
        "Matemática": "Lê/registra números até 10 e relaciona às quantidades; \nconta elementos de coleções, compara, ordena e classifica; \nresolve adição/subtração com resultados até 10; \norienta-se/desloca-se no espaço por um ponto de referência; \nclassifica/ordena por atributos; \nidentifica períodos do dia, dias da semana, meses, datas; \ncompara/ordena comprimentos; \ninvestiga situações de interesse e registra. \nAmpliações ao longo do ano: até 30, ideias iniciais de multiplicação/divisão, leitura de quadros/gráficos simples.",
        "Língua Portuguesa": "Respeita turnos de fala; \nparticipa de leituras e escritas coletivas; \nreconhece o alfabeto; \nexpressa ideias com clareza; \nlê palavras e frases; \nestabelece relação som–letra; \nescreve palavras e frases; \nrecita textos da tradição oral com entonação adequada; \nreconhece a mesma palavra em diferentes tipos de letra."
        },
        "2": {
        "Ciências": "Identifica materiais (metais, madeira, vidro, plástico) e seus usos considerando propriedades (flexibilidade, dureza, transparência; permeável/impermeável); compreende redução de desperdício e tecnologias que minimizam impactos; diferencia seres vivos (animais, plantas, fungos, bactérias) de componentes não vivos (ar, água, solo, rochas, luz, calor do Sol); identifica partes das plantas e funções; descreve posições do Sol e sombras; identifica cuidados com exposição solar e tecnologias de proteção; compara efeito da radiação solar em diferentes superfícies (água, areia, solo; claras/escuras/metálicas).",
        "Geografia": "Localiza elementos na sala com referenciais (inclui direita/esquerda); reconhece objetos e lugares da escola/entorno em mapas, imagens aéreas e fotos; desenha espaços de vivência com proporcionalidade e localização correta; compara costumes e tradições da comunidade e respeita diferenças; descreve paisagens (construções, funções, placas e sinalizações); compara meios de transporte/comunicação e discute riscos/uso responsável.",
        "História": "Compara sua infância com a de outros tempos usando fontes (objetos, documentos, fotos); narra modos de viver de crianças em diferentes tempos (morar, brincar, estudar, comunicar-se, locomover-se) e identifica mudanças/permanências; explica formas de organização de grupos (família, escola, povos originários, quilombolas) a partir de fontes; narra direitos e responsabilidades com base em documentos (DUDC, ECA); narra formas de trabalho e impactos ambientais na comunidade.",
        "Matemática": "Lê/registra/compara números até 100; conta por agrupamentos e reconhece valor posicional; resolve adição e subtração até 100; classifica/ordena por atributos; lê/registra datas e meses; mede/estima/compara comprimentos (unidades não convencionais e convencionais); localiza/desloca-se com múltiplos referenciais; lê/constrói quadros e gráficos de barras/colunas; ampliações: até 1000, operações até centenas, ideias iniciais de multiplicação e divisão, leitura de horas (hora/meia), massa e sistema monetário.",
        "Língua Portuguesa": "Participa de interações orais (ouvir, contar, recontar); lê pequenos textos; explora rimas e aliterações; escreve pequenos textos; expressa ideias com sequência lógica; localiza informações explícitas; reconhece variações som–letra; mantém unidade temática; identifica finalidade/assunto; usa espaçamento entre palavras."
        },
        "3": {
        "Ciências": "Identifica fontes de som naturais/artificiais e hábitos de saúde auditiva; relaciona fontes de luz com objetos transparentes/opacos e hábitos para saúde dos olhos; diferencia fontes de calor, materiais condutores/isolantes e tecnologias (isolamento/termômetros); descreve ciclos de vida e modos de vida dos animais (inclusive humanos); compara animais por características externas; reconhece animais que podem causar acidentes/doenças; identifica características da Terra com representações (mapas, globos, fotos) e registra visibilidade de astros; explica formação/composição do solo; compreende atmosfera e vento.",
        "Geografia": "Elabora/representa trajetos com desenhos; utiliza planta simples/mapa para localizar elementos; lê legenda; reconhece paisagens de Curitiba e entorno; compreende Curitiba como espaço urbano e suas atividades produtivas; reconhece diversidade humana e contribuições étnicas; reconhece modos de vida de povos e comunidades tradicionais.",
        "História": "Constrói narrativas sobre patrimônio histórico, cultural e ambiental de Curitiba; compara espaços públicos e privados do município; narra ocupação e povoamento de Curitiba (bandeirantes, negros, imigrantes) a partir de fontes; narra diversidade cultural (povos originários, portugueses, africanos, imigrantes); interpreta direitos e responsabilidades na cidade (leis ambientais, trânsito, poderes); interpreta símbolos municipais (hino, bandeira, brasão).",
        "Matemática": "Lê/escreve números até 1000; compreende SND até 3ª ordem; estima/aproxima/cálculo mental; constrói significados de multiplicações (2 a 6); resolve adição/subtração; organiza sequências por adições/subtrações sucessivas e descreve a regra; mede comprimentos (m, cm, mm); lê/constrói gráficos e interpreta tabelas simples/dupla entrada; ampliações: ordinais até 30; multiplicações de 2 a 10; problemas com dobro/triplo/metade/terça; horas (hora, meia e 15 min); sistema monetário.",
        "Língua Portuguesa": "Formula/responde questões orais; ativa conhecimentos prévios; amplia vocabulário em escrita; acentua palavras; adequa a fala a situações; infere informações; pontua textos; produz textos coerentes; defende ponto de vista oralmente; estabelece relações entre partes do texto; segmenta corretamente palavras; usa concordância nominal."
        },
        "4": {
        "Ciências": "Identifica misturas do cotidiano; relata transformações de materiais (aquecimento, resfriamento, luz, umidade); reconhece a célula como unidade básica; diferencia uni/pluricelulares; constrói cadeias alimentares simples e reconhece o papel do Sol; reconhece microrganismos, doenças associadas e relações com ambiente/sociedade/tecnologia; reconhece direções cardeais via Sol/sombra (gnômon); associa ciclos da Lua/Terra a períodos e calendários; identifica componentes do Sistema Solar e características dos planetas.",
        "Geografia": "Usa direções cardeais para orientação (mapas, croquis, maquetes, espaço geográfico); compreende mapa como representação reduzida (escala); compara mapas e outras representações (globo, maquetes, plantas, croquis); descreve processos migratórios e contribuições; conhece paisagens do Paraná (relevo, vegetação, rios, clima e relações); identifica intervenções humanas (urbanização, desmatamento, poluição); compreende atividades produtivas nos espaços urbano/rural (setores econômicos); reconhece interdependência campo–cidade (fluxos).",
        "História": "Narra primeiras formações sociais a partir de fontes; narra mudanças/permanências (nomadismo/sedentarismo, agricultura/pastoreio, escrita, circulação); orienta-se temporalmente sobre ocupação/povoamento do Brasil/Paraná (povos originários, presença africana, imigrantes, migrantes); explica diversidade cultural como resultado de ações de diferentes povos; interpreta direitos e responsabilidades no Paraná (leis, terras indígenas/quilombolas, patrimônio); constrói narrativa sobre símbolos estaduais (hino, bandeira, brasão).",
        "Matemática": "Lê/escreve números até 10.000; SND até 4ª ordem; estima, arredonda e calcula mentalmente; multiplicações de 2 a 10; resolve adição/subtração e multiplicação/divisão; identifica regularidades; mede comprimentos, massa e capacidade (unidades convencionais); localiza/desloca objetos com linguagem geométrica; interpreta tabelas/dupla entrada e gráficos; ampliações: frações, temperaturas, medidas de tempo, sólidos e planificações, coleta e representação de dados.",
        "Língua Portuguesa": "Reconhece características da conversação espontânea e formas de tratamento; identifica ideia central; analisa/usa concordância verbal; usa expressividade na fala; infere significados por contexto; reconhece e usa elementos coesivos; expõe oralmente com roteiro; estabelece relações de causa e consequência; respeita convenções ortográficas regulares; organiza a produção segundo o gênero."
        },
        "5": {
        "Ciências": "Reconhece propriedades físicas de materiais (densidade, condutividade térmica/eléctrica, magnetismo, solubilidade, dureza/elasticidade etc.); explica ciclo da água e implicações (agricultura, clima, energia, água potável, ecossistemas); identifica usos da água/materiais e propõe consumo consciente, descarte/reutilização/reciclagem; reconhece corpo humano como sistema integrado (células, tecidos, órgãos, sistemas) e sistemas ligados à nutrição; entende grupos alimentares e influência da mídia; identifica constelações; reconhece rotação/translação e estações; reconhece fases da Lua e suas influências; conhece tecnologias para estudo do Universo (luneta, telescópio) e agências (AEB, NASA).",
        "Geografia": "Lê/interpreta mapas (símbolos, orientação, legenda, título, subtítulo, fonte, escala); analisa dinâmicas populacionais no Paraná (migrações/infraestrutura); identifica diferenças étnico-raciais/culturais e desigualdades; conhece paisagens do Brasil (relevo, vegetação, rios, clima e ação humana); identifica e propõe soluções a problemas socioambientais locais; analisa transformações urbanas por imagens aéreas/satélite; identifica funções das cidades e mudanças sociais/econômicas/ambientais; compara mudanças do trabalho e desenvolvimento tecnológico; identifica tipos de energia no cotidiano e produção.",
        "História": "Argumenta sobre povos nômades/sedentários e migrações; explica modos de vida dos povos originários (Brasil/Paraná); narra significado de cidadania em diferentes contextos; relaciona cidadania a respeito à diversidade e direitos humanos; explica primeiros contatos (originários, europeus, africanos); narra formas de exploração econômica e impactos (pau-brasil, cana, mineração); interpreta movimentos de resistência (Inconfidência, Conjuração Baiana, Emancipação do PR, Federalista, Contestado); narra movimentos sociais/políticos/culturais do Paraná; argumenta sobre patrimônio material/imaterial; narra tradições orais e símbolos nacionais.",
        "Matemática": "Lê/escreve números de diferentes magnitudes; compõe/decompõe no SND; estima/arredonda/cálculo mental; reconhece pares/ímpares; resolve adição/subtração e multiplicação/divisão; regularidades por ×/÷ por 1,10,100,1000; mede comprimentos, massa, capacidade (com transformações); localiza/desloca com vários referenciais (inclui coordenadas); interpreta tabelas e gráficos (linhas, pictóricos, barras/colunas); frações/decimais: representa, compara, ordena; opera com naturais e racionais (adição/subtração/multiplicação/divisão); propriedades de igualdade; intervalos de tempo; sistema monetário; figuras planas; média aritmética; frações equivalentes; percentuais usuais; perímetro/área de retângulos; ampliação/redução com proporcionalidade; probabilidade simples.",
        "Língua Portuguesa": "Usa expressividade na fala; distingue fato de opinião; relaciona título e texto; produz textos adequados à situação comunicativa; reconhece e respeita modos de falar; identifica ironia/humor; argumenta em produções escritas; usa hifenização na translineação; defende ponto de vista; lê com proficiência; respeita convenções ortográficas irregulares; escreve adequando-se ao gênero e ao contexto."
        }
    },
    "2": {
        "1": {
        "Ciências": "Compara características de materiais do cotidiano (cor, brilho, odor, sabor, textura, transparência, temperatura e forma); identifica atitudes de preservação ambiental e descarte correto; localiza e nomeia partes do corpo (órgãos dos sentidos, cabeça, pescoço, tronco, membros) e explica funções; reconhece hábitos saudáveis, autocuidado e respeito às diferenças; identifica objetos/tecnologias que ampliam sentidos; identifica escalas de tempo (dia, semana, mês, ano); caracteriza céu e astros visíveis; reconhece o Sol como fonte natural de luz e calor.",
        "Geografia": "Localiza pessoas/objetos nos espaços de vivência usando referenciais (dentro/fora, ao lado, frente/trás, perto/longe, cima/baixo, antes/depois, entre, junto/separado); reconhece e elabora símbolos de objetos do espaço vivido; descreve a paisagem e a ação humana nas transformações; associa vestuário/hábitos à variação de temperatura/umidade; identifica grupos sociais (família, escola, comunidade) e atividades; reconhece diversidade humana e situações de preconceito.",
        "História": "Narra a própria identidade e história de vida; \ndescreve cotidiano de crianças hoje (família, escola, comunidade); \nnarra manifestações culturais dos grupos de convívio; \ncompara modos de viver de crianças em diferentes tempos e espaços a partir de fontes; \nnarra regras, direitos e responsabilidades na família, escola e comunidade.",
        "Matemática": "Lê/registra números até 10 e relaciona às quantidades; conta elementos de coleções, compara, ordena e classifica; resolve adição/subtração com resultados até 10; orienta-se/desloca-se no espaço por um ponto de referência; classifica/ordena por atributos; identifica períodos do dia, dias da semana, meses, datas; compara/ordena comprimentos; investiga situações de interesse e registra. Ampliações ao longo do ano: até 30, ideias iniciais de multiplicação/divisão, leitura de quadros/gráficos simples.",
        "Língua Portuguesa": "Respeita turnos de fala; participa de leituras e escritas coletivas; reconhece o alfabeto; expressa ideias com clareza; lê palavras e frases; estabelece relação som–letra; escreve palavras e frases; recita textos da tradição oral com entonação adequada; reconhece a mesma palavra em diferentes tipos de letra."
        },
        "2": {
        "Ciências": "Identifica materiais (metais, madeira, vidro, plástico) e seus usos considerando propriedades (flexibilidade, dureza, transparência; permeável/impermeável); compreende redução de desperdício e tecnologias que minimizam impactos; diferencia seres vivos (animais, plantas, fungos, bactérias) de componentes não vivos (ar, água, solo, rochas, luz, calor do Sol); identifica partes das plantas e funções; descreve posições do Sol e sombras; identifica cuidados com exposição solar e tecnologias de proteção; compara efeito da radiação solar em diferentes superfícies (água, areia, solo; claras/escuras/metálicas).",
        "Geografia": "Localiza elementos na sala com referenciais (inclui direita/esquerda); reconhece objetos e lugares da escola/entorno em mapas, imagens aéreas e fotos; desenha espaços de vivência com proporcionalidade e localização correta; compara costumes e tradições da comunidade e respeita diferenças; descreve paisagens (construções, funções, placas e sinalizações); compara meios de transporte/comunicação e discute riscos/uso responsável.",
        "História": "Compara sua infância com a de outros tempos usando fontes (objetos, documentos, fotos); narra modos de viver de crianças em diferentes tempos (morar, brincar, estudar, comunicar-se, locomover-se) e identifica mudanças/permanências; explica formas de organização de grupos (família, escola, povos originários, quilombolas) a partir de fontes; narra direitos e responsabilidades com base em documentos (DUDC, ECA); narra formas de trabalho e impactos ambientais na comunidade.",
        "Matemática": "Lê/registra/compara números até 100; conta por agrupamentos e reconhece valor posicional; resolve adição e subtração até 100; classifica/ordena por atributos; lê/registra datas e meses; mede/estima/compara comprimentos (unidades não convencionais e convencionais); localiza/desloca-se com múltiplos referenciais; lê/constrói quadros e gráficos de barras/colunas; ampliações: até 1000, operações até centenas, ideias iniciais de multiplicação e divisão, leitura de horas (hora/meia), massa e sistema monetário.",
        "Língua Portuguesa": "Participa de interações orais (ouvir, contar, recontar); lê pequenos textos; explora rimas e aliterações; escreve pequenos textos; expressa ideias com sequência lógica; localiza informações explícitas; reconhece variações som–letra; mantém unidade temática; identifica finalidade/assunto; usa espaçamento entre palavras."
        },
        "3": {
        "Ciências": "Identifica fontes de som naturais/artificiais e hábitos de saúde auditiva; relaciona fontes de luz com objetos transparentes/opacos e hábitos para saúde dos olhos; diferencia fontes de calor, materiais condutores/isolantes e tecnologias (isolamento/termômetros); descreve ciclos de vida e modos de vida dos animais (inclusive humanos); compara animais por características externas; reconhece animais que podem causar acidentes/doenças; identifica características da Terra com representações (mapas, globos, fotos) e registra visibilidade de astros; explica formação/composição do solo; compreende atmosfera e vento.",
        "Geografia": "Elabora/representa trajetos com desenhos; utiliza planta simples/mapa para localizar elementos; lê legenda; reconhece paisagens de Curitiba e entorno; compreende Curitiba como espaço urbano e suas atividades produtivas; reconhece diversidade humana e contribuições étnicas; reconhece modos de vida de povos e comunidades tradicionais.",
        "História": "Constrói narrativas sobre patrimônio histórico, cultural e ambiental de Curitiba; compara espaços públicos e privados do município; narra ocupação e povoamento de Curitiba (bandeirantes, negros, imigrantes) a partir de fontes; narra diversidade cultural (povos originários, portugueses, africanos, imigrantes); interpreta direitos e responsabilidades na cidade (leis ambientais, trânsito, poderes); interpreta símbolos municipais (hino, bandeira, brasão).",
        "Matemática": "Lê/escreve números até 1000; compreende SND até 3ª ordem; estima/aproxima/cálculo mental; constrói significados de multiplicações (2 a 6); resolve adição/subtração; organiza sequências por adições/subtrações sucessivas e descreve a regra; mede comprimentos (m, cm, mm); lê/constrói gráficos e interpreta tabelas simples/dupla entrada; ampliações: ordinais até 30; multiplicações de 2 a 10; problemas com dobro/triplo/metade/terça; horas (hora, meia e 15 min); sistema monetário.",
        "Língua Portuguesa": "Formula/responde questões orais; ativa conhecimentos prévios; amplia vocabulário em escrita; acentua palavras; adequa a fala a situações; infere informações; pontua textos; produz textos coerentes; defende ponto de vista oralmente; estabelece relações entre partes do texto; segmenta corretamente palavras; usa concordância nominal."
        },
        "4": {
        "Ciências": "Identifica misturas do cotidiano; relata transformações de materiais (aquecimento, resfriamento, luz, umidade); reconhece a célula como unidade básica; diferencia uni/pluricelulares; constrói cadeias alimentares simples e reconhece o papel do Sol; reconhece microrganismos, doenças associadas e relações com ambiente/sociedade/tecnologia; reconhece direções cardeais via Sol/sombra (gnômon); associa ciclos da Lua/Terra a períodos e calendários; identifica componentes do Sistema Solar e características dos planetas.",
        "Geografia": "Usa direções cardeais para orientação (mapas, croquis, maquetes, espaço geográfico); compreende mapa como representação reduzida (escala); compara mapas e outras representações (globo, maquetes, plantas, croquis); descreve processos migratórios e contribuições; conhece paisagens do Paraná (relevo, vegetação, rios, clima e relações); identifica intervenções humanas (urbanização, desmatamento, poluição); compreende atividades produtivas nos espaços urbano/rural (setores econômicos); reconhece interdependência campo–cidade (fluxos).",
        "História": "Narra primeiras formações sociais a partir de fontes; narra mudanças/permanências (nomadismo/sedentarismo, agricultura/pastoreio, escrita, circulação); orienta-se temporalmente sobre ocupação/povoamento do Brasil/Paraná (povos originários, presença africana, imigrantes, migrantes); explica diversidade cultural como resultado de ações de diferentes povos; interpreta direitos e responsabilidades no Paraná (leis, terras indígenas/quilombolas, patrimônio); constrói narrativa sobre símbolos estaduais (hino, bandeira, brasão).",
        "Matemática": "Lê/escreve números até 10.000; SND até 4ª ordem; estima, arredonda e calcula mentalmente; multiplicações de 2 a 10; resolve adição/subtração e multiplicação/divisão; identifica regularidades; mede comprimentos, massa e capacidade (unidades convencionais); localiza/desloca objetos com linguagem geométrica; interpreta tabelas/dupla entrada e gráficos; ampliações: frações, temperaturas, medidas de tempo, sólidos e planificações, coleta e representação de dados.",
        "Língua Portuguesa": "Reconhece características da conversação espontânea e formas de tratamento; identifica ideia central; analisa/usa concordância verbal; usa expressividade na fala; infere significados por contexto; reconhece e usa elementos coesivos; expõe oralmente com roteiro; estabelece relações de causa e consequência; respeita convenções ortográficas regulares; organiza a produção segundo o gênero."
        },
        "5": {
        "Ciências": "Reconhece propriedades físicas de materiais (densidade, condutividade térmica/eléctrica, magnetismo, solubilidade, dureza/elasticidade etc.); explica ciclo da água e implicações (agricultura, clima, energia, água potável, ecossistemas); identifica usos da água/materiais e propõe consumo consciente, descarte/reutilização/reciclagem; reconhece corpo humano como sistema integrado (células, tecidos, órgãos, sistemas) e sistemas ligados à nutrição; entende grupos alimentares e influência da mídia; identifica constelações; reconhece rotação/translação e estações; reconhece fases da Lua e suas influências; conhece tecnologias para estudo do Universo (luneta, telescópio) e agências (AEB, NASA).",
        "Geografia": "Lê/interpreta mapas (símbolos, orientação, legenda, título, subtítulo, fonte, escala); analisa dinâmicas populacionais no Paraná (migrações/infraestrutura); identifica diferenças étnico-raciais/culturais e desigualdades; conhece paisagens do Brasil (relevo, vegetação, rios, clima e ação humana); identifica e propõe soluções a problemas socioambientais locais; analisa transformações urbanas por imagens aéreas/satélite; identifica funções das cidades e mudanças sociais/econômicas/ambientais; compara mudanças do trabalho e desenvolvimento tecnológico; identifica tipos de energia no cotidiano e produção.",
        "História": "Argumenta sobre povos nômades/sedentários e migrações; explica modos de vida dos povos originários (Brasil/Paraná); narra significado de cidadania em diferentes contextos; relaciona cidadania a respeito à diversidade e direitos humanos; explica primeiros contatos (originários, europeus, africanos); narra formas de exploração econômica e impactos (pau-brasil, cana, mineração); interpreta movimentos de resistência (Inconfidência, Conjuração Baiana, Emancipação do PR, Federalista, Contestado); narra movimentos sociais/políticos/culturais do Paraná; argumenta sobre patrimônio material/imaterial; narra tradições orais e símbolos nacionais.",
        "Matemática": "Lê/escreve números de diferentes magnitudes; compõe/decompõe no SND; estima/arredonda/cálculo mental; reconhece pares/ímpares; resolve adição/subtração e multiplicação/divisão; regularidades por ×/÷ por 1,10,100,1000; mede comprimentos, massa, capacidade (com transformações); localiza/desloca com vários referenciais (inclui coordenadas); interpreta tabelas e gráficos (linhas, pictóricos, barras/colunas); frações/decimais: representa, compara, ordena; opera com naturais e racionais (adição/subtração/multiplicação/divisão); propriedades de igualdade; intervalos de tempo; sistema monetário; figuras planas; média aritmética; frações equivalentes; percentuais usuais; perímetro/área de retângulos; ampliação/redução com proporcionalidade; probabilidade simples.",
        "Língua Portuguesa": "Usa expressividade na fala; distingue fato de opinião; relaciona título e texto; produz textos adequados à situação comunicativa; reconhece e respeita modos de falar; identifica ironia/humor; argumenta em produções escritas; usa hifenização na translineação; defende ponto de vista; lê com proficiência; respeita convenções ortográficas irregulares; escreve adequando-se ao gênero e ao contexto."
        }
    }
}